RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_spi.c
/**
 **************************************************************************
 * File Name    : at32f4xx_spi.c
 * Description  : at32f4xx SPI source file
 * Date         : 2018-10-08
 * Version      : V1.0.5
 **************************************************************************
 */


/* Includes ------------------------------------------------------------------*/
#include "at32f4xx_spi.h"
#include "at32f4xx_rcc.h"

/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @defgroup SPI
  * @brief SPI driver modules
  * @{
  */

/** @defgroup SPI_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */


/** @defgroup SPI_Private_Defines
  * @{
  */

/* SPI SPE mask */
#define CTRL1_SPIEN_SET         ((uint16_t)0x0040)
#define CTRL1_SPIEN_RESET       ((uint16_t)0xFFBF)

/* I2S I2SE mask */
#define I2SCTRL_I2SEN_SET       ((uint16_t)0x0400)
#define I2SCTRL_I2SEN_RESET     ((uint16_t)0xFBFF)

/* SPI CRCNext mask */
#define CTRL1_CTN_SET           ((uint16_t)0x1000)

/* SPI CRCEN mask */
#define CTRL1_CCE_SET           ((uint16_t)0x2000)
#define CTRL1_CCE_RESET         ((uint16_t)0xDFFF)

/* SPI SSOE mask */
#define CTRL2_NSSOE_SET         ((uint16_t)0x0004)
#define CTRL2_NSSOE_RESET       ((uint16_t)0xFFFB)

/* SPI registers Masks */
#define CTRL1_CLEAR_MASK        ((uint16_t)0x3040)
#define I2SCTRL_CLEAR_MASK      ((uint16_t)0xF040)

/* SPI or I2S mode selection masks */
#define SPI_MODE_SEL            ((uint16_t)0xF7FF)
#define I2S_MODE_SEL            ((uint16_t)0x0800)

/* I2S clock source selection masks */
#define I2S2_CLK_SRC            ((uint32_t)(0x00020000))
#define I2S3_CLK_SRC            ((uint32_t)(0x00040000))
#define I2S_MUL_MASK            ((uint32_t)(0x0000F000))
#define I2S_DIV_MASK            ((uint32_t)(0x000000F0))

/**
  * @}
  */

/** @defgroup SPI_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup SPI_Private_Variables
  * @{
  */

/**
  * @}
  */

/** @defgroup SPI_Private_FunctionPrototypes
  * @{
  */

/**
  * @}
  */

/** @defgroup SPI_Private_Functions
  * @{
  */

/**
  * @brief  Deinitializes the SPIx peripheral registers to their default
  *         reset values (Affects also the I2Ss).
  * @param  SPIx: where x can be 1, 2, 3 or 4 to select the SPI peripheral.
  * @retval None
  */
void SPI_I2S_Reset(SPI_Type* SPIx)
{
  /* Check the parameters */
  assert_param(IS_SPI_ALL_PERIPH(SPIx));

  if (SPIx == SPI1)
  {
    /* Enable SPI1 reset state */
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_SPI1, ENABLE);
    /* Release SPI1 from reset state */
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_SPI1, DISABLE);
  }
  else if (SPIx == SPI2)
  {
    /* Enable SPI2 reset state */
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_SPI2, ENABLE);
    /* Release SPI2 from reset state */
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_SPI2, DISABLE);
  }
#if defined (AT32F403xx) || defined (AT32F403Axx) || \
    defined (AT32F407xx)
  else if (SPIx == SPI3)
  {
    /* Enable SPI3 reset state */
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_SPI3, ENABLE);
    /* Release SPI3 from reset state */
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_SPI3, DISABLE);
  }
  else if (SPIx == SPI4)
  {
    /* Enable SPI4 reset state */
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_SPI4, ENABLE);
    /* Release SPI4 from reset state */
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_SPI4, DISABLE);
  }
#endif
}

/**
  * @brief  Initializes the SPIx peripheral according to the specified
  *         parameters in the SPI_InitStruct.
  * @param  SPIx: where x can be 1, 2, 3 or 4 to select the SPI peripheral.
  * @param  SPI_InitStruct: pointer to a SPI_InitType structure that
  *         contains the configuration information for the specified SPI peripheral.
  * @retval None
  */
void SPI_Init(SPI_Type* SPIx, SPI_InitType* SPI_InitStruct)
{
  uint16_t tmpreg = 0;

  /* check the parameters */
  assert_param(IS_SPI_ALL_PERIPH(SPIx));

  /* Check the SPI parameters */
  assert_param(IS_SPI_TRANS_MODE(SPI_InitStruct->SPI_TransMode));
  assert_param(IS_SPI_MODE(SPI_InitStruct->SPI_Mode));
  assert_param(IS_SPI_FRAMESIZE(SPI_InitStruct->SPI_FrameSize));
  assert_param(IS_SPI_CPOL(SPI_InitStruct->SPI_CPOL));
  assert_param(IS_SPI_CPHA(SPI_InitStruct->SPI_CPHA));
  assert_param(IS_SPI_NSSSEL(SPI_InitStruct->SPI_NSSSEL));
  assert_param(IS_SPI_MCLKP(SPI_InitStruct->SPI_MCLKP));
  assert_param(IS_SPI_FIRST_BIT(SPI_InitStruct->SPI_FirstBit));
  assert_param(IS_SPI_CPOLY(SPI_InitStruct->SPI_CPOLY));

  /*---------------------------- SPIx CTRL1 Configuration ------------------------*/
  /* Get the SPIx CTRL1 value */
  tmpreg = SPIx->CTRL1;
  /* Clear BIDIMode, BIDIOE, RxONLY, SSM, SSI, LSBFirst, BR, MSTR, CPOL and CPHA bits */
  tmpreg &= CTRL1_CLEAR_MASK;
  /* Configure SPIx: direction, NSS management, first transmitted bit, BaudRate prescaler
     master/salve mode, CPOL and CPHA */
  /* Set BIDImode, BIDIOE and RxONLY bits according to SPI_Direction value */
  /* Set SSM, SSI and MSTR bits according to SPI_Mode and SPI_NSS values */
  /* Set LSBFirst bit according to SPI_FirstBit value */
  /* Set BR bits according to SPI_BaudRatePrescaler value */
  /* Set CPOL bit according to SPI_CPOL value */
  /* Set CPHA bit according to SPI_CPHA value */

  if (SPI_InitStruct->SPI_MCLKP & SPI_MCLKP_OVER_256)
  {
    /* MCLKP is over 256 */
    SPIx->CTRL2 |= SPI_CTRL2_MCLKP_3;
  }
  else
  {
    SPIx->CTRL2 &= ~SPI_CTRL2_MCLKP_3;
  }

  tmpreg |= (uint16_t)((uint32_t)SPI_InitStruct->SPI_TransMode | SPI_InitStruct->SPI_Mode |
                       SPI_InitStruct->SPI_FrameSize | SPI_InitStruct->SPI_CPOL |
                       SPI_InitStruct->SPI_CPHA | SPI_InitStruct->SPI_NSSSEL |
                       (SPI_InitStruct->SPI_MCLKP & 0x7FFF) | SPI_InitStruct->SPI_FirstBit);
  /* Write to SPIx CTRL1 */
  SPIx->CTRL1 = tmpreg;


  /* Activate the SPI mode (Reset I2SMOD bit in I2SCFGR register) */
  SPIx->I2SCTRL &= SPI_MODE_SEL;

  /*---------------------------- SPIx CRCPOLY Configuration --------------------*/
  /* Write to SPIx CRCPOLY */
  SPIx->CPOLY = SPI_InitStruct->SPI_CPOLY;
}

/**
  * @brief  Initializes the SPIx peripheral according to the specified
  *         parameters in the I2S_InitStruct.
  * @param  SPIx: where x can be 2, 3, or 4 to select the SPI peripheral
  *         (configured in I2S mode).
  * @param  I2S_InitStruct: pointer to an I2S_InitType structure that
  *         contains the configuration information for the specified SPI peripheral
  *         configured in I2S mode.
  * @note
  *  The function calculates the optimal prescaler needed to obtain the most
  *  accurate audio frequency (depending on the I2S clock source, the PLL values
  *  and the product configuration). But in case the prescaler value is greater
  *  than 511, the default value (0x02) will be configured instead.  *
  * @retval None
  */
void I2S_Init(SPI_Type* SPIx, I2S_InitType* I2S_InitStruct)
{
  uint16_t tmpreg = 0, i2sdiv = 2, i2sodd = 0, packetlength = 1;
  uint32_t tmp = 0;
  RCC_ClockType RCC_Clocks;
  uint32_t sourceclock = 0;

  /* Check the I2S parameters */
  assert_param(IS_SPI_I2S_PERIPH(SPIx));
  assert_param(IS_I2S_MODE(I2S_InitStruct->I2S_Mode));
  assert_param(IS_I2S_AUDIOPROTOCOL(I2S_InitStruct->I2s_AudioProtocol));
  assert_param(IS_I2S_FRAMEFORMAT(I2S_InitStruct->I2S_FrameFormat));
  assert_param(IS_I2S_MCLKOE(I2S_InitStruct->I2S_MCLKOE));
  assert_param(IS_I2S_AUDIO_FREQ(I2S_InitStruct->I2S_AudioFreq));
  assert_param(IS_I2S_CPOL(I2S_InitStruct->I2S_CPOL));

  /*----------------------- SPIx I2SCFGR & I2SPR Configuration -----------------*/
  /* Clear I2SMOD, I2SE, I2SCFG, PCMSYNC, I2SSTD, CKPOL, DATLEN and CHLEN bits */
  SPIx->I2SCTRL &= I2SCTRL_CLEAR_MASK;
  SPIx->I2SCLKP = 0x0002;

