RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_spi.c
  if (SPI_CRC != SPI_CRC_RX)
  {
    /* Get the Tx CRC register */
    crcreg = SPIx->TCRC;
  }
  else
  {
    /* Get the Rx CRC register */
    crcreg = SPIx->RCRC;
  }

  /* Return the selected CRC register */
  return crcreg;
}

/**
  * @brief  Returns the CRC Polynomial register value for the specified SPI.
  * @param  SPIx: where x can be 1, 2, 3 or 4 to select the SPI peripheral.
  * @retval The CRC Polynomial register value.
  */
uint16_t SPI_GetCRCPolynomial(SPI_Type* SPIx)
{
  /* Check the parameters */
  assert_param(IS_SPI_ALL_PERIPH(SPIx));

  /* Return the CRC polynomial register */
  return SPIx->CPOLY;
}

/**
  * @brief  Selects the data transfer direction in bi-directional mode for the specified SPI.
  * @param  SPIx: where x can be 1, 2, 3 or 4 to select the SPI peripheral.
  * @param  SPI_Direction: specifies the data transfer direction in bi-directional mode.
  *   This parameter can be one of the following values:
  *     @arg SPI_HALFDUPLEX_TX: Selects Tx transmission direction
  *     @arg SPI_HALFDUPLEX_RX: Selects Rx receive direction
  * @retval None
  */
void SPI_HalfDuplexTransModeConfig(SPI_Type* SPIx, uint16_t SPI_Direction)
{
  /* Check the parameters */
  assert_param(IS_SPI_ALL_PERIPH(SPIx));
  assert_param(IS_SPI_DIRECTION(SPI_Direction));

  if (SPI_Direction == SPI_HALFDUPLEX_TX)
  {
    /* Set the Tx only mode */
    SPIx->CTRL1 |= SPI_HALFDUPLEX_TX;
  }
  else
  {
    /* Set the Rx only mode */
    SPIx->CTRL1 &= SPI_HALFDUPLEX_RX;
  }
}

/**
  * @brief  Checks whether the specified SPI/I2S flag is set or not.
  * @param  SPIx: where x can be
  *   - 1, 2, 3, or 4 in SPI mode
  *   - 2, 3, or 4 in I2S mode
  * @param  SPI_I2S_FLAG: specifies the SPI/I2S flag to check.
  *   This parameter can be one of the following values:
  *     @arg SPI_I2S_FLAG_TE: Transmit buffer empty flag.
  *     @arg SPI_I2S_FLAG_RNE: Receive buffer not empty flag.
  *     @arg SPI_I2S_FLAG_BUSY: Busy flag.
  *     @arg SPI_I2S_FLAG_OVR: Overrun flag.
  *     @arg SPI_FLAG_MODF: Mode Fault flag.
  *     @arg SPI_FLAG_CERR: CRC Error flag.
  *     @arg I2S_FLAG_UDR: Underrun Error flag.
  *     @arg I2S_FLAG_CS: Channel Side flag.
  * @retval The new state of SPI_I2S_FLAG (SET or RESET).
  */
FlagStatus SPI_I2S_GetFlagStatus(SPI_Type* SPIx, uint16_t SPI_I2S_FLAG)
{
  FlagStatus bitstatus = RESET;
  /* Check the parameters */
  assert_param(IS_SPI_ALL_PERIPH(SPIx));
  assert_param(IS_SPI_I2S_GET_FLAG(SPI_I2S_FLAG));

  /* Check the status of the specified SPI/I2S flag */
  if ((SPIx->STS & SPI_I2S_FLAG) != (uint16_t)RESET)
  {
    /* SPI_I2S_FLAG is set */
    bitstatus = SET;
  }
  else
  {
    /* SPI_I2S_FLAG is reset */
    bitstatus = RESET;
  }

  /* Return the SPI_I2S_FLAG status */
  return  bitstatus;
}

/**
  * @brief  Clears the SPIx CRC Error (CRCERR) flag.
  * @param  SPIx: where x can be
  *   - 1, 2, 3, or 4 in SPI mode
  * @param  SPI_I2S_FLAG: specifies the SPI flag to clear.
  *   This function clears only CRCERR flag.
  * @note
  *   - OVR (OverRun error) flag is cleared by software sequence: a read
  *     operation to SPI_DT register (SPI_I2S_RxData()) followed by a read
  *     operation to SPI_STS register (SPI_I2S_GetFlagStatus()).
  *   - UDR (UnderRun error) flag is cleared by a read operation to
  *     SPI_STS register (SPI_I2S_GetFlagStatus()).
  *   - MODF (Mode Fault) flag is cleared by software sequence: a read/write
  *     operation to SPI_STS register (SPI_I2S_GetFlagStatus()) followed by a
  *     write operation to SPI_CTRL1 register (SPI_Enable() to enable the SPI).
  * @retval None
  */
void SPI_I2S_ClearFlag(SPI_Type* SPIx, uint16_t SPI_I2S_FLAG)
{
  /* Check the parameters */
  assert_param(IS_SPI_ALL_PERIPH(SPIx));
  assert_param(IS_SPI_I2S_CLEAR_FLAG(SPI_I2S_FLAG));

  /* Clear the selected SPI CRC Error (CRCERR) flag */
  SPIx->STS = (uint16_t)~SPI_I2S_FLAG;
}

/**
  * @brief  Checks whether the specified SPI/I2S interrupt has occurred or not.
  * @param  SPIx: where x can be
  *   - 1, 2, 3, or 4 in SPI mode
  *   - 2, 3, or 4 in I2S mode
  * @param  SPI_I2S_INT: specifies the SPI/I2S interrupt source to check.
  *   This parameter can be one of the following values:
  *     @arg SPI_I2S_INT_TE: Transmit buffer empty interrupt.
  *     @arg SPI_I2S_INT_RNE: Receive buffer not empty interrupt.
  *     @arg SPI_I2S_INT_OVR: Overrun interrupt.
  *     @arg SPI_INT_MODF: Mode Fault interrupt.
  *     @arg SPI_INT_CERR: CRC Error interrupt.
  *     @arg I2S_INT_UDR: Underrun Error interrupt.
  * @retval The new state of SPI_I2S_INT (SET or RESET).
  */
ITStatus SPI_I2S_GetITStatus(SPI_Type* SPIx, uint8_t SPI_I2S_INT)
{
  ITStatus bitstatus = RESET;
  uint16_t itpos = 0, itmask = 0, enablestatus = 0;

  /* Check the parameters */
  assert_param(IS_SPI_ALL_PERIPH(SPIx));
  assert_param(IS_SPI_I2S_GET_INT(SPI_I2S_INT));

  /* Get the SPI/I2S INT index */
  itpos = 0x01 << (SPI_I2S_INT & 0x0F);

  /* Get the SPI/I2S INT mask */
  itmask = SPI_I2S_INT >> 4;

  /* Set the INT mask */
  itmask = 0x01 << itmask;

  /* Get the SPI_I2S_INT enable bit status */
  enablestatus = (SPIx->CTRL2 & itmask) ;

  /* Check the status of the specified SPI/I2S interrupt */
  if (((SPIx->STS & itpos) != (uint16_t)RESET) && enablestatus)
  {
    /* SPI_I2S_INT is set */
    bitstatus = SET;
  }
  else
  {
    /* SPI_I2S_INT is reset */
    bitstatus = RESET;
  }

  /* Return the SPI_I2S_INT status */
  return bitstatus;
}

/**
  * @brief  Clears the SPIx CRC Error (CRCERR) interrupt pending bit.
  * @param  SPIx: where x can be
  *   - 1, 2, 3, or 4 in SPI mode
  * @param  SPI_I2S_INT: specifies the SPI interrupt pending bit to clear.
  *   This function clears only CRCERR interrupt pending bit.
  * @note
  *   - OVR (OverRun Error) interrupt pending bit is cleared by software
  *     sequence: a read operation to SPI_DT register (SPI_I2S_RxData())
  *     followed by a read operation to SPI_STS register (SPI_I2S_GetITStatus()).
  *   - UDR (UnderRun Error) interrupt pending bit is cleared by a read
  *     operation to SPI_STS register (SPI_I2S_GetITStatus()).
  *   - MODF (Mode Fault) interrupt pending bit is cleared by software sequence:
  *     a read/write operation to SPI_STS register (SPI_I2S_GetITStatus())
  *     followed by a write operation to SPI_CTRL1 register (SPI_Enable() to enable
  *     the SPI).
  * @retval None
  */
void SPI_I2S_ClearINTPendingBit(SPI_Type* SPIx, uint8_t SPI_I2S_INT)
{
  uint16_t itpos = 0;
  /* Check the parameters */
  assert_param(IS_SPI_ALL_PERIPH(SPIx));
  assert_param(IS_SPI_I2S_CLEAR_INT(SPI_I2S_INT));

  /* Get the SPI INT index */
  itpos = 0x01 << (SPI_I2S_INT & 0x0F);

  /* Clear the selected SPI CRC Error (CRCERR) interrupt pending bit */
  SPIx->STS = (uint16_t)~itpos;
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


